{
    "contentSettings": {
        "aboutBlurb": "<b class=\"text-primary\">Career Full-Stack, UI/UX AI-Enabled Applications Developer with over 10+ years of industry experience.</b><br /><br />Hello, I'm Scott C. Lonis, but, you can call me Scotty. I've worked on projects of all sizes and flavors from small single page brochure websites to full enterprise and e-commerce applications.&nbsp; While I have worked as both backend, frontend and full-stack developer, my primary focus these days is&nbsp;working with <b class=\"text-primary\">React, Redux,  Redux Toolkit Next.js, Radix.ui and Tailwind CSS</b> primarily as a UI/UX developer, and more recently incorporating <b class=\"text-primary\">Artificial Intelligence</b> with <b class=\"text-primary\">Cursor.ai</b> to exponentially boost my productivity.&nbsp;Still, I enjoy working with node.js and pure programming exercises&nbsp;every bit as much as I do UI/UX development.<div><br></div>\n\n<div>I actually don't consider myself a designer so much as a full-stack developer with decent Photoshop skills.  While I can do design(ish), I'm really at my best in an iterative Agile workflow environment in collaboration with a designer whose focus is on great user experience, and who is not afraid to test the limits of what is possible.  This leaves me free to do what I'm do best, which is to help bring a good designer's vision to life.\n\nI can honestly say that I very much enjoy what I do, and while it's been challenging at times to stay relevant in such a fast-moving industry, I've managed to adapt and become even better as time has moved on.&nbsp;<div><div><br></div><div>My hobbies include learning new technologies, perfecting the omelette, riding my 2020 Harley Davidson Road Glide Limited, traveling, surfing, yoga, anything on the beach, travel, playing guitar (badly), posting pictures of my food online and petting ferule kittens.</div></div></div></div></div>",
        "aboutTitle": "About Me",
        "contactEmail": "scott.lonis@outlook.com",
        "contactPhone": "(214) 923-3658",
        "facebookId": "",
        "githubId": "ScottyCompton",
        "instagramId": "",
        "linkedinUsername": "scott-lonis",
        "resumeUrl": "https://drive.google.com/file/d/1hDqjgCf8gy0GLExrpamEIow9HSyU-A63/view?usp=sharing",
        "siteTitle": "Scott C. Lonis - Programming and Graphic Design Portfolio",
        "twitterHandle": "",
        "youTubeId": "",
        "aboutImgUrl": "https://firebasestorage.googleapis.com/v0/b/webfolio-4c731.appspot.com/o/settings%2Fscotty_mowhawk.jpg?alt=media&token=9d014557-c2f2-47c1-b531-e822883e1c66",
        "__v": 0
    }
}
